---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunWidthLessThanWalkLineOffsetFailure
source: html/a3917917-5eeb-cbcc-1a0f-8e6bb45074ed.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunWidthLessThanWalkLineOffsetFailure Property

The value for Run Width is less than two times of value of the inside walkline offset.

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderRunWidthLessThanWalkLineOffsetFailure { get; }
```